Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-effect_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: hooks-state title: Using the Effect Hook permalink: docs/hooks-effect.html next: hooks-rules.html prev: hooks-state.html ---
ja: --- id: hooks-state title: 副作用フックの利用法 permalink: docs/hooks-effect.html next: hooks-rules.html prev: hooks-state.html ---

source: *Hooks* are a new addition in React 16.8.
ja: *フック (hook)* は React 16.8 で追加された新機能です。

source: They let you use state and other React features without writing a class.
ja: state などの React の機能を、クラスを書かずに使えるようになります。

source: The *Effect Hook* lets you perform side effects in function components:
ja: *副作用 (effect) フック* により、関数コンポーネント内で副作用を実行することができるようになります：

source: This snippet is based on the [counter example from the previous page](/docs/hooks-state.html), but we added a new feature to it: we set the document title to a custom message including the number of clicks.
ja: このスニペットは [1 つ前のページのカウンターの例](/docs/hooks-state.html)に基づいていますが、新しい機能をひとつ加えてあります。クリック回数を含んだカスタムのメッセージをドキュメントのタイトルにセットしているのです。

source: Data fetching, setting up a subscription, and manually changing the DOM in React components are all examples of side effects.
ja: データの取得、購読 (subscription) の設定、あるいは React コンポーネント内の DOM の手動での変更、といったものはすべて副作用の例です。

source: Whether or not you're used to calling these operations "side effects" (or just "effects"), you've likely performed them in your components before.
ja: これらを "副作用 (side-effect)"（あるいは単に "作用 (effect)"）と呼ぶことに慣れているかどうかはともかくとしても、これらのようなことをコンポーネントの中で行ったことはあるでしょう。

source: >Tip > >If you're familiar with React class lifecycle methods, you can think of `useEffect` Hook as `componentDidMount`, `componentDidUpdate`, and `componentWillUnmount` combined.
ja: > ヒント > > React のライフサイクルに馴染みがある場合は、`useEffect` フックを `componentDidMount` と `componentDidUpdate` と `componentWillUnmount` がまとまったものだと考えることができます。

source: There are two common kinds of side effects in React components: those that don't require cleanup, and those that do.
ja: React コンポーネントにおける副作用には 2 種類あります。クリーンアップコードを必要としない副作用と、必要とする副作用です。

source: Let's look at this distinction in more detail.
ja: これらの違いについて詳しく見ていきましょう。

source: ## Effects Without Cleanup {#effects-without-cleanup}
ja: ## クリーンアップを必要としない副作用 {#effects-without-cleanup}

source: Sometimes, we want to **run some additional code after React has updated the DOM.** Network requests, manual DOM mutations, and logging are common examples of effects that don't require a cleanup.
ja: 時に、**React が DOM を更新した後で追加のコードを実行したい**という場合があります。ネットワークリクエストの送信、手動での DOM 改変、ログの記録、といったものがクリーンアップを必要としない副作用の例です。

source: We say that because we can run them and immediately forget about them.
ja: なぜかというとそれらのコードが実行されたあとすぐにそのことを忘れても構わないからです。

source: Let's compare how classes and Hooks let us express such side effects.
ja: クラスとフックとでそのような副作用をどのように表現するのか比較してみましょう。

source: ### Example Using Classes {#example-using-classes}
ja: ### クラスを使った例 {#example-using-classes}

source: In React class components, the `render` method itself shouldn't cause side effects.
ja: React のクラスコンポーネントでは、`render` メソッド自体が副作用を起こすべきではありません。

source: It would be too early -- we typically want to perform our effects *after* React has updated the DOM.
ja: そこで副作用を起こすのは早すぎます -- 典型的には、副作用は React が DOM を更新した*あと*に起こすようにしたいのです。

source: This is why in React classes, we put side effects into `componentDidMount` and `componentDidUpdate`.
ja: そのため React のクラスでは、副作用は `componentDidMount` と `componentDidUpdate` に記載します。

source: Coming back to our example, here is a React counter class component that updates the document title right after React makes changes to the DOM:
ja: 例に戻ると、以下が React のクラスで実装したカウンターコンポーネントであり、React が DOM に変更を加えた後に、ドキュメントのタイトルを更新しています。

source: Note how **we have to duplicate the code between these two lifecycle methods in class.**
ja: ここで**同じコードを 2 回書かなければならなかった**ことに注意してください。

source: This is because in many cases we want to perform the same side effect regardless of whether the component just mounted, or if it has been updated.
ja: これは、コンポーネントがマウント直後なのか更新後なのかに関係なく、大抵の場合は同じ副作用を起こしたいからです。

source: Conceptually, we want it to happen after every render -- but React class components don't have a method like this.
ja: 概念的には、毎回のレンダー時に起こってほしいのですが、React のクラスコンポーネントにはそのようなメソッドは存在していません。

source: We could extract a separate method but we would still have to call it in two places.
ja: 副作用のコードを別のメソッドに抽出することは可能ですが、2 か所でそのメソッドを呼ばなければいけないことに変わりはありません。

source: Now let's see how we can do the same with the `useEffect` Hook.
ja: では、同じことが `useEffect` フックを用いるとどのように記述できるのか見ていきましょう。

source: ### Example Using Hooks {#example-using-hooks}
ja: ### フックを使った例 {#example-using-hooks}

source: We've already seen this example at the top of this page, but let's take a closer look at it:
ja: 以下の例は既にこのページの最初で見たものですが、改めて詳しく見ていきましょう。

source: **What does `useEffect` do?** By using this Hook, you tell React that your component needs to do something after render.
ja: **`useEffect` は何をやっているのか？** このフックを使うことで、レンダー後に何かの処理をしないといけない、ということを React に伝えます。

source: React will remember the function you passed (we'll refer to it as our "effect"), and call it later after performing the DOM updates.
ja: React はあなたが渡した関数を覚えており（これを「副作用（関数）」と呼ぶこととします）、DOM の更新の後にそれを呼び出します。

source: In this effect, we set the document title, but we could also perform data fetching or call some other imperative API.
ja: この副作用の場合はドキュメントのタイトルをセットしていますが、データを取得したりその他何らかの命令型の API を呼び出したりすることも可能です。

source: **Why is `useEffect` called inside a component?** Placing `useEffect` inside the component lets us access the `count` state variable (or any props) right from the effect.
ja: **`useEffect` がコンポーネント内で呼ばれるのはなぜか？** コンポーネント内で `useEffect` を記述することで、副作用内から state である `count`（や任意の props）にアクセスできるようになります。

source: We don't need a special API to read it -- it's already in the function scope.
ja: それらは既に関数スコープ内に存在するので、参照するための特別な API は必要ありません。

source: Hooks embrace JavaScript closures and avoid introducing React-specific APIs where JavaScript already provides a solution.
ja: フックは JavaScript のクロージャを活用しており、JavaScript で解決できることに対して React 特有の API を導入することはしません。

source: **Does `useEffect` run after every render?** Yes!
ja: **`useEffect` は毎回のレンダー後に呼ばれるのか？

source: By default, it runs both after the first render *and* after every update.
ja: ** その通りです！デフォルトでは、副作用関数は初回のレンダー時*および*毎回の更新時に呼び出されます。

source: (We will later talk about [how to customize this](#tip-optimizing-performance-by-skipping-effects).) Instead of thinking in terms of "mounting" and "updating", you might find it easier to think that effects happen "after render".
ja: あとで[カスタマイズする方法](#tip-optimizing-performance-by-skipping-effects)について説明します。「マウント」と「更新」という観点で考えるのではなく、「レンダーの後」に副作用は起こる、というように考える方が簡単かもしれません。

source: React guarantees the DOM has been updated by the time it runs the effects.
ja: React は、副作用が実行される時点では DOM が正しく更新され終わっていることを保証します。

source: ### Detailed Explanation {#detailed-explanation}
ja: ### 詳しい説明 {#detailed-explanation}

source: Now that we know more about effects, these lines should make sense:
ja: 副作用について学んだので、以下の行の意味はお分かりかと思います。

source: We declare the `count` state variable, and then we tell React we need to use an effect.
ja: ここでは `count` という state 変数を宣言し、次に副作用を使うことを React に伝えています。

source: We pass a function to the `useEffect` Hook.
ja: `useEffect` フックには関数を渡しています。

source: This function we pass *is* our effect.
ja: この関数こそが副作用関数です。

source: Inside our effect, we set the document title using the `document.title` browser API.
ja: この副作用関数内で `document.title` というブラウザ API を使ってドキュメントのタイトルを設定しています。

source: We can read the latest `count` inside the effect because it's in the scope of our function.
ja: 副作用関数は関数スコープ内にあるため最新の `count` の値は副作用内から参照可能です。

source: When React renders our component, it will remember the effect we used, and then run our effect after updating the DOM. This happens for every render, including the first one.
ja: React がコンポーネントをレンダーする際に React はこの副作用を覚えておき、DOM を更新した後に呼び出します。これは初回を含む毎回のレンダー時に発生します。

source: Experienced JavaScript developers might notice that the function passed to `useEffect` is going to be different on every render.
ja: 経験のある JavaScript 開発者であれば、`useEffect` に渡される関数は毎回のレンダーごとに異なっているということに気付くかもしれません。

source: This is intentional.
ja: これは意図的なものです。

source: In fact, this is what lets us read the `count` value from inside the effect without worrying about it getting stale.
ja: むしろ、そのようにすることで、古い値を参照してしまう心配なしに副作用関数内から `count` を読むことができるのです。

source: Every time we re-render, we schedule a _different_ effect, replacing the previous one.
ja: 再レンダーごとに、React は*違う*副作用関数をスケジュールし、前のものを置き換えます。

source: In a way, this makes the effects behave more like a part of the render result -- each effect "belongs" to a particular render.
ja: ある意味で、こうすることで副作用はレンダーの結果の一部のようにふるまうようになります -- それぞれの副作用は特定の 1 回のレンダーと結びついているのです。

source: We will see more clearly why this is useful [later on this page](#explanation-why-effects-run-on-each-update).
ja: これがなぜ便利なのかについては[このページの後半](#explanation-why-effects-run-on-each-update)で明らかになるでしょう。

source: >Tip > >Unlike `componentDidMount` or `componentDidUpdate`, effects scheduled with `useEffect` don't block the browser from updating the screen.
ja: > ヒント > > `componentDidMount` や `componentDidUpdate` と異なり、`useEffect` でスケジュールされた副作用はブラウザによる画面更新をブロックしません。

source: This makes your app feel more responsive.
ja: このためアプリの反応がより良く感じられます。

source: The majority of effects don't need to happen synchronously.
ja: 大部分の副作用は同期的に行われる必要がありません。

source: In the uncommon cases where they do (such as measuring the layout), there is a separate [`useLayoutEffect`](/docs/hooks-reference.html#uselayouteffect) Hook with an API identical to `useEffect`.
ja: 同期的に行う必要がある稀なケース（レイアウトの測定など）のために、`useEffect` と同一の API を有する [`useLayoutEffect`](/docs/hooks-reference.html#uselayouteffect) という別のフックがあります。

source: ## Effects with Cleanup {#effects-with-cleanup}
ja: ## クリーンアップを有する副作用 {#effects-with-cleanup}

source: Earlier, we looked at how to express side effects that don't require any cleanup.
ja: ここまでに、クリーンアップを必要としない副作用の表現のしかたについて見てきました。

source: However, some effects do.
ja: しかし幾つかの副作用ではそれが必要です。

source: For example, **we might want to set up a subscription** to some external data source.
ja: 例えば何らかの外部のデータソースへの**購読をセットアップしたい**ことがあります。

source: In that case, it is important to clean up so that we don't introduce a memory leak!
ja: そのような場合、メモリリークが発生しないようにクリーンアップが必要です！

source: Let's compare how we can do it with classes and with Hooks.
ja: クラスの場合とフックの場合とでクリーンアップをどのように行えるのか比較しましょう。

source: ### Example Using Classes {#example-using-classes-1}
ja: ### クラスを使った例 {#example-using-classes-1}

source: In a React class, you would typically set up a subscription in `componentDidMount`, and clean it up in `componentWillUnmount`.
ja: React のクラスでは、典型的にはデータの購読を `componentDidMount` で行い、クリーンアップを `componentWillUnmount` で行います。

source: For example, let's say we have a `ChatAPI` module that lets us subscribe to a friend's online status.
ja: 例えば、フレンドのオンライン状態を購読することができる `ChatAPI` というモジュールがあるとしましょう。

source: Here's how we might subscribe and display that status using a class:
ja: 以下がクラスを使ってその状態を購読し、表示する例です。

source: Notice how `componentDidMount` and `componentWillUnmount` need to mirror each other.
ja: ここで、`componentDidMount` と `componentWillUnmount` とがお互いに鏡のように対応していないといけないことに注意してください。

source: Lifecycle methods force us to split this logic even though conceptually code in both of them is related to the same effect.
ja: ライフサイクルメソッドを使うと、2 つのメソッドに書かれているコードが概念上は同一の副作用に関連しているとしても、それらを分割して書かないといけません。

source: >Note > >Eagle-eyed readers may notice that this example also needs a `componentDidUpdate` method to be fully correct.
ja: > 補足 > > 目ざとい読者なら、この例が完全に正しいものであるためには `componentDidUpdate` も必要だと気付くかもしれません。

source: We'll ignore this for now but will come back to it in a [later section](#explanation-why-effects-run-on-each-update) of this page.
ja: 今のところは気にしないでおきますが、このページの[後に出てくる節](#explanation-why-effects-run-on-each-update)で改めて説明します。

source: ### Example Using Hooks {#example-using-hooks-1}
ja: ### フックを使った例 {#example-using-hooks-1}

source: Let's see how we could write this component with Hooks.
ja: このコンポーネントをフックを使ってどのように書けるのか見ていきましょう。

source: You might be thinking that we'd need a separate effect to perform the cleanup.
ja: クリーンアップ用の別の副作用が必要だとお考えかもしれません。

source: But code for adding and removing a subscription is so tightly related that `useEffect` is designed to keep it together.
ja: しかし購読を開始するコードと解除するコードとは密に関連しているため、`useEffect` はそれらを一緒に書けるようにデザインされています。

source: If your effect returns a function, React will run it when it is time to clean up:
ja: あなたの副作用が関数を返した場合、React はクリーンアップのタイミングが来たらそれを実行するのです。

source: **Why did we return a function from our effect?
ja: **副作用内からなぜ関数を返したのか？

source: ** This is the optional cleanup mechanism for effects.
ja: ** これこそが副作用のクリーンアップのためのオプションの仕組みです。

source: Every effect may return a function that cleans up after it.
ja: すべての副作用は、それをクリーンアップするための関数を返すことができます。

source: This lets us keep the logic for adding and removing subscriptions close to each other.
ja: これにより購読を開始するためのロジックと解除するためのロジックを並べて書くことができます。

source: They're part of the same effect!
ja: 両方とも同じ副作用の一部なのです！

source: **When exactly does React clean up an effect?** React performs the cleanup when the component unmounts.
ja: **React は具体的には副作用のクリーンアップをいつ発生させるのか？** React はコンポーネントがアンマウントされるときにクリーンアップを実行します。

source: However, as we learned earlier, effects run for every render and not just once.
ja: しかし、すでに学んだ通り、副作用は 1 回だけでなく毎回のレンダー時に実行されます。

source: This is why React *also* cleans up effects from the previous render before running the effects next time.
ja: このため React は、ひとつ前のレンダーによる副作用を、次回の副作用を実行する前に*も*クリーンアップします。

source: We'll discuss [why this helps avoid bugs](#explanation-why-effects-run-on-each-update) and [how to opt out of this behavior in case it creates performance issues](#tip-optimizing-performance-by-skipping-effects) later below.
ja: この後で、これが[なぜバグの回避につながるのか](#explanation-why-effects-run-on-each-update)、そして[これがパフォーマンスの問題を引き起こしている場合にどのようにしてこの挙動を止めるのか](#tip-optimizing-performance-by-skipping-effects)について説明します。

source: >Note > >We don't have to return a named function from the effect.
ja: > 補足 > > 副作用から名前付きの関数を返す必要はありません。

source: We called it `cleanup` here to clarify its purpose, but you could return an arrow function or call it something different.
ja: ここでは目的を明示するために `cleanup` という名前にしましたが、アロー関数を返すことも別の名前を付けることも可能です。

source: ## Recap {#recap}
ja: ## まとめ {#recap}

source: We've learned that `useEffect` lets us express different kinds of side effects after a component renders.
ja: `useEffect` を用いることで、コンポーネントのレンダー後に実行される様々な種類の副作用を表現できることを学びました。

source: Some effects might require cleanup so they return a function:
ja: いくつかの副作用はクリーンアップが必要である可能性があり、その場合は関数を返します：

source: Other effects might not have a cleanup phase, and don't return anything.
ja: クリーンアップフェーズが必要ない副作用もあり、その場合は何も返す必要はありません。

source: The Effect Hook unifies both use cases with a single API.
ja: 副作用フックは両方のユースケースをひとつの API に統合します。

source: **If you feel like you have a decent grasp on how the Effect Hook works, or if you feel overwhelmed, you can jump to the [next page about Rules of Hooks](/docs/hooks-rules.html) now.**
ja: **副作用フックの動作について十分わかったと感じる場合や、逆にもううんざりだという場合は、ここで[次のページ（フックのルールについて）](/docs/hooks-rules.html)に進んでも構いません。**

source: ## Tips for Using Effects {#tips-for-using-effects}
ja: ## 副作用を使う場合のヒント {#tips-for-using-effects}

source: We'll continue this page with an in-depth look at some aspects of `useEffect` that experienced React users will likely be curious about.
ja: このページの残りの部分では、経験のある React 利用者が興味を持つかもしれない `useEffect` の深い概念について説明します。

source: Don't feel obligated to dig into them now.
ja: 今すぐ読み進める必要があるとは思わないでください。

source: You can always come back to this page to learn more details about the Effect Hook.
ja: 副作用フックについて詳細が知りたくなったらいつでもこのページに戻ってくればいいのです。

source: ### Tip: Use Multiple Effects to Separate Concerns {#tip-use-multiple-effects-to-separate-concerns}
ja: ### ヒント：関心を分離するために複数の副作用を使う {#tip-use-multiple-effects-to-separate-concerns}

source: One of the problems we outlined in the [Motivation](/docs/hooks-intro.html#complex-components-become-hard-to-understand) for Hooks is that class lifecycle methods often contain unrelated logic, but related logic gets broken up into several methods.
ja: フックを[導入する動機](/docs/hooks-intro.html#complex-components-become-hard-to-understand)のページで述べた問題のひとつは、しばしばそれぞれのライフサイクルメソッドに関連のないロジックが含まれ、一方で関連するロジックが複数のメソッドに分割されてしまう、ということです。

source: Here is a component that combines the counter and the friend status indicator logic from the previous examples:
ja: 以下に示すのは、これまでの例で挙げたカウンタとフレンド状態インジケータとを組み合わせたコンポーネントです。

source: Note how the logic that sets `document.title` is split between `componentDidMount` and `componentDidUpdate`.
ja: ここで、`document.title` を設定するためのロジックが `componentDidMount` と `componentDidUpdate` に分離してしまっていることに注意してください。

source: The subscription logic is also spread between `componentDidMount` and `componentWillUnmount`.
ja: データ購読のためのロジックもやはり `componentDidMount` と `componentWillUnmount` とに分離しています。

source: And `componentDidMount` contains code for both tasks.
ja: そして `componentDidMount` には両方の仕事のためのコードが含まれています。

source: So, how can Hooks solve this problem?
ja: ではフックはどのようにこの問題を解決するのでしょうか？

source: Just like [you can use the *State* Hook more than once](/docs/hooks-state.html#tip-using-multiple-state-variables), you can also use several effects.
ja: [*ステート*フックを複数回呼べる](/docs/hooks-state.html#tip-using-multiple-state-variables)のと同様の方法で、副作用を複数回利用することができます。

source: This lets us separate unrelated logic into different effects:
ja: このため、互いに関係のないロジックは別の副作用に分離することが可能です。

source: **Hooks let us split the code based on what it is doing** rather than a lifecycle method name.
ja: フックを使うことで、ライフサイクルのメソッド名に基づくのではなく、**実際に何をやっているのかに基づいてコードを分割できます**。

source: React will apply *every* effect used by the component, in the order they were specified.
ja: React はコンポーネントで利用されている*すべての*副作用を、指定されている順番で適用していきます。

source: ### Explanation: Why Effects Run on Each Update {#explanation-why-effects-run-on-each-update}
ja: ### 解説：なぜ副作用は毎回の更新ごとに実行されるのか {#explanation-why-effects-run-on-each-update}

source: If you're used to classes, you might be wondering why the effect cleanup phase happens after every re-render, and not just once during unmounting.
ja: クラスに慣れていれば、なぜクリーンアップフェーズは、アンマウント時の 1 度だけではなく再レンダー時に毎回発生するのか、と不思議に思っているかもしれません。

source: Let's look at a practical example to see why this design helps us create components with fewer bugs.
ja: 実践的な例で、この設計によりなぜバグの少ないコンポーネントが作れるようになるのか見てみましょう。

source: [Earlier on this page](#example-using-classes-1), we introduced an example `FriendStatus` component that displays whether a friend is online or not.
ja: [このページの前の部分](#example-using-classes-1)で、フレンドがオンラインかどうかを表示する `FriendStatus` コンポーネントの例を示しました。

source: Our class reads `friend.id` from `this.props`, subscribes to the friend status after the component mounts, and unsubscribes during unmounting:
ja: このクラスでは `this.props` の中にある `friend.id` を参照して、コンポーネントがマウントした後にフレンドのステータスを購読し、アンマウント時には購読を解除します：

source: **But what happens if the `friend` prop changes** while the component is on the screen?
ja: ですがコンポーネントが表示されている最中に **`friend` プロパティが変わったらどうなるのでしょう**か？

source: Our component would continue displaying the online status of a different friend.
ja: このコンポーネントは間違ったフレンドのオンラインステータスを表示し続けてしまいます。

source: This is a bug.
ja: これはバグです。

source: We would also cause a memory leak or crash when unmounting since the unsubscribe call would use the wrong friend ID.
ja: しかも誤ったフレンド ID を使って購読解除を呼び出してしまうため、アンマウント時にメモリリークやクラッシュを引き起こしてしまうでしょう。

source: In a class component, we would need to add `componentDidUpdate` to handle this case:
ja: クラスコンポーネントの場合は、このようなケースに対処するために `componentDidUpdate` を加える必要がありました。

source: Forgetting to handle `componentDidUpdate` properly is a common source of bugs in React applications.
ja: 適切な `componentDidUpdate` 処理をし忘れることが、React アプリケーションにおけるよくあるバグの原因となっていました。

source: Now consider the version of this component that uses Hooks:
ja: ではこのコンポーネントのフックを利用したバージョンを見てみましょう。

source: It doesn't suffer from this bug.
ja: 動作は変わっておらず、前述のバグも起こらなくなります。

source: (But we also didn't make any changes to it.)
ja: `useEffect` は*デフォルトで*更新を処理するため、更新のための特別なコードは不要です。

source: There is no special code for handling updates because `useEffect` handles them *by default*.
ja: 新しい副作用を適用する前に、ひとつ前の副作用をクリーンアップします。

source: It cleans up the previous effects before applying the next effects.
ja: これを例示するため、このコンポーネントが経時的に発生させる可能性のある購読登録と購読解除のシーケンスを示します：

source: To illustrate this, here is a sequence of subscribe and unsubscribe calls that this component could produce over time:
ja: ```js // Mount with { friend: { id: 100 } } props ChatAPI.subscribeToFriendStatus(100, handleStatusChange); // Run first effect

source: ```js // Mount with { friend: { id: 100 } } props ChatAPI.subscribeToFriendStatus(100, handleStatusChange); // Run first effect // Update with { friend: { id: 200 } } props ChatAPI.unsubscribeFromFriendStatus(100, handleStatusChange); // Clean up previous effect ChatAPI.subscribeToFriendStatus(200, handleStatusChange); // Run next effect
ja: // Update with { friend: { id: 200 } } props ChatAPI.unsubscribeFromFriendStatus(100, handleStatusChange); // Clean up previous effect ChatAPI.subscribeToFriendStatus(200, handleStatusChange); // Run next effect

source: This behavior ensures consistency by default and prevents bugs that are common in class components due to missing update logic.
ja: この挙動によりデフォルトで一貫性を保証することができ、クラスコンポーネントでよく見られた更新ロジック書き忘れによるバグを防止することができます。

source: ### Tip: Optimizing Performance by Skipping Effects {#tip-optimizing-performance-by-skipping-effects}
ja: ### ヒント：副作用のスキップによるパフォーマンス改善 {#tip-optimizing-performance-by-skipping-effects}

source: In some cases, cleaning up or applying the effect after every render might create a performance problem.
ja: いくつかの場合では、副作用のクリーンアップと適用とをレンダーごとに毎回行うことはパフォーマンスの問題を引き起こす可能性があります。

source: In class components, we can solve this by writing an extra comparison with `prevProps` or `prevState` inside `componentDidUpdate`:
ja: クラスコンポーネントの場合、この問題は `componentDidUpdate` の内部で `prevProps` や `prevState` と比較するコードを加えることで解決できました。

source: This requirement is common enough that it is built into the `useEffect` Hook API.
ja: これはよくある要求なので、`useEffect` フックの API にはこの動作が組み込まれています。

source: You can tell React to *skip* applying an effect if certain values haven't changed between re-renders.
ja: 再レンダー間で特定の値が変わっていない場合には副作用の適用を*スキップ*するよう、React に伝えることができるのです。

source: To do so, pass an array as an optional second argument to `useEffect`:
ja: そのためには、`useEffect` のオプションの第 2 引数として配列を渡してください。

source: In the example above, we pass `[count]` as the second argument.
ja: 上記の例では、第 2 引数として `[count]` を渡しています。

source: What does this mean?
ja: どういう意味でしょうか？

source: If the `count` is `5`, and then our component re-renders with `count` still equal to `5`, React will compare `[5]` from the previous render and `[5]` from the next render.
ja: もし `count` が `5` で、次回のコンポーネントのレンダー時にも `count` がまだ `5` であった場合、React は前回のレンダー時に覚えておいた `[5]` と今回のレンダーの `[5]` とを比較します。

source: Because all items in the array are the same (`5 === 5`), React would skip the effect.
ja: 配列内のすべての要素が同一 (`5 === 5`) ですので、React は副作用をスキップします。

source: That's our optimization.
ja: これが最適化です。

source: When we render with `count` updated to `6`, React will compare the items in the `[5]` array from the previous render to items in the `[6]` array from the next render.
ja: 再レンダー時に `count` が `6` に変更されている場合、前回レンダー時に覚えておいた `[5]` と今回のレンダー時の `[6]` という配列とを比較します。

source: This time, React will re-apply the effect because `5 !== 6`.
ja: 今回は `5 !== 6` ですので React は副作用を再適用します。

source: If there are multiple items in the array, React will re-run the effect even if just one of them is different.
ja: 配列内に複数の要素がある場合、React は配列内の要素のうちひとつでも変わっている場合に副作用を再実行します。

source: This also works for effects that have a cleanup phase:
ja: クリーンアップフェーズがある副作用でも同様に動作します：
